# Найти длину строки string.
# Результат сохранить в переменной string_length

string = "What's the length of me"


#############################

# Вспомним, как работают операторы в Python на примере нескольких задач

# Сложить числа из переменной number1 и number2. Результатом их сложения
# должен быть числовой тип данных. Результат сохранить в переменной result.

number1 = '212'
number2 = 46


# В переменной string1 дана строка. С помощью одного из операторов Python
# сохрани данную строку, повторяющуюся 5 раз,  в переменной result2. Допустим,
# у тебя есть строка "some string", результат выражения в данном примере будет
# "some stringsome stringsome stringsome stringsome string"

string1 = "I'm string"


# Сохрани в переменную result3 строку "2 times", полученную из числа
# 2 и строки times, используя преобразования типов и конкатенацию:

...


#################

# Работа со строками

# В переменной value лежит значение Our first lesson. Сохрани в
# переменную tmp_result подстроку rst, а в переменную tmp_result2 строку on.
# После этого сложи 2 получившиеся подстроки и результат сохрани в переменной
# result4. Используй механизм срезов.

value = 'Our first lesson'


# Задание попроще. В переменную result5 сохрани подстроку "substring" из
# переменной value1. В переменную result6 сохрани подстроку "It's my".
# За основу бери также value1.

value1 = "It's my substring"

# Извлеки из строки some_string все числа и проссумируй их в переменной
# numbers_from_string. Результат в переменной numbers_from_string должен быть
# числом(числовой тип данных). Можешь пользоваться любыми инструментами,
# будь то индексы или строковые методы

some_string = "Str1ng w1th numb3rs. Pl3ase fold us8"

# Используя строку upper_string, в переменную result_string сохрани новую
# строку, записанную в нижнем регистре. Вспомни специальной строковый метод.


upper_string = "I'm StrIng With Upper case chaRs"
