# Создай функцию sum_entered_number.
# На каждой итерации цикла пользователь вводит целое число. Цикл продолжается,
# пока не встретится число 0. Необходимо вычислить сумму введенных в цикле
# чисел и вывести результат на экран. Программу реализовать при помощи цикла
# while.

...


# Создай функцию sum_numbers_of_num
# Вводится натуральное (то есть, целое положительное) число
# (от трехзначного и более). Найти произведение всех его цифр. Результат
# вывести на экран. Программу реализовать при помощи цикла while.

...
