# Объяви три класса геометрических фигур: Line, Rect, Ellipse. Должна быть возможность создавать объекты
# каждого класса следующими командами:
#
# g1 = Line(a, b, c, d)
# g2 = Rect(a, b, c, d)
# g3 = Ellipse(a, b, c, d)
# Здесь в качестве аргументов a, b, c, d передаются координаты верхнего правого и нижнего левого углов
# (произвольные числа). В каждом объекте координаты должны сохраняться в локальных свойствах sp (верхний правый угол)
# и ep (нижний левый) в виде кортежей (a, b) и (c, d) соответственно.
#
# Сформируй 217 объектов этих классов: для каждого текущего объекта класс выбирается случайно (или Line, или
# Rect, или Ellipse). Координаты также генерируются случайным образом (числовые значения). Все объекты сохрани
# в списке elements.

