# Необходимо объявить класс StreamData с методом:

# def create(self, fields, lst_values): ...

# который бы на входе получал кортеж FIELDS из названий локальных атрибутов (передается в атрибут fields) и
# список строк (передается в атрибут lst_values) и формировал бы в объекте класса StreamData локальные
# свойства с именами полей из fields и соответствующими значениями из lst_values.
#
# Если создание локальных свойств проходит успешно, то метод create() возвращает True, иначе - False. Если число
# полей и число строк не совпадает, то метод create() возвращает False и локальные атрибуты создавать не нужно.


a = []

list.append(a, 12)
print(a)
a.append(12)
