# #1
# В переменной value хранится строковое представление числа.
# Получи модуль этого числа, используя функцию abs() и запиши
# его в ту же переменную value. Перед этим нужно привести строку к числу.

value = "-42"


# #2
# Сохрани в переменную arya_hungry две строки:
# Do you want to eat, <name>? и Yes, I'm hungry, mom.
# Вместо <name> должна использоваться переменная stark.
# При формировании итоговой строки используй интерполяцию.
# Вывод должен получиться таким (только без пустой строки в конце):
# Do you want to eat, Arya?
# Yes, I'm hungry, mom.

stark = 'Arya'


# #3
# В коде программы определены две переменные, содержащие имена компаний.
# Посчитай их общую длину в символах и сохрани в переменную symbols_in_names

company1 = "Apple"
company2 = "Samsung"


# #4
# Дана строка, в которой нужно заменить все вхождения yes на no.
# Сохрани результат в переменной without_yes

string = 'I say yes and another yes for your offer'

# #5
# Здесь все просто - нужно перевести строку в верхний регистер и сохранить
# в переменной string_upper

another_string = 'string in lower register'
