# №1 Реализуй функцию get_users, которая принимает на вход неограниченное количество кортежей
# с информацией о пользователях вида "('username', age, 'city', 'phone_number)'".
# Твоя функция должна возвращать список со словарями вида:
# [
#   {
#   'username': username,
#   user_info: {
#   'age': age,
#   'city': city,
#   'number': phone_number},
#   },
#   ...
#]
# То есть твоя функция должна делать из каждого кортежа словарь, в котором есть ключ 'username',
# а также ключ 'user_info', значением которого является словарь с информацией о юзере.


...
