# Объяви функцию get_tag_string, которая принимает строку и заключает ее в
# указанный тег. Тег определяется именованным параметров tag с начальным
# значением в виде строки "h1". Например, мы передаем строку "Hello Python" и
# заключаем в тег "h1". На выходе должны получить строку (без кавычек):
# "<h1>Hello Python</h1>"

# Пример
# get_tag_string('Hello', tag='div') # => <div>Hello</div>

...

# Объяви функцию с именем get_rect_value, которая принимает два аргумента
# (два числа) и еще один именованный параметр type с начальным значением 0.
# Если параметр type равен нулю, то функция должна возвращать периметр
# прямоугольника, а иначе - его площадь.

...



