# Задача 1.
# Твоя задача реализовать функцию mul_numbers, которая принимает на вход 2 аргумента: любую последовательность(объекты
# в последовательности могут быть любого типа данных) объектов и функцию. Функция должна возвращать список с числами,
# возведенными в квадрат. Возвести числа в квадрат и проверить, является ли объект числом - ответственность функции,
# которая принимается вторым аргументом.


...

# Задача 2.
# Объяви анонимную (лямбда) функцию с двумя параметрами для деления одного целого числа на другое. Если происходит
# деление на ноль, то функция должна возвращать значение None, иначе - результат деления.


...


# Задача 3.
# Реализуй функцию filter_sequence, которая принимает на вход 2 параметра: последовательность из чисел(float or int) и ключ.
# Ключ по умолчанию имеет значение None. Если ключ is None, то функция просто должна вернуть переданный в нее список
# без изменений. В противном случае ключ должен фильтровать список, формируя:

# - cписок только из отрицательных чисел;
# - cписок только из неотрицательных чисел (то есть, включая и 0);
# - cписок из чисел в диапазоне [3; 5]
# - список только из float
# - список только из int
