# Практика 1

# Реализуй функцию get_float_num(), которая принимает на вход список чисел(int or float). Твоя задачи преобразовать все
# числа в этом списке тип данных float и вернуть список из первых 3 чисел. Для решения используй встроенные функции высшего порядка


# Практика 2

# Реализуй функцию get_tuples_items(), которая принимает на вход строку вида:
# ключ_1=значение_1 ключ_2=значение_2 ... ключ_N=значение_N

# Функция должна возвращать кортеж вида:
# tp = (('ключ_1', 'значение_1'), ('ключ_2', 'значение_2'), ..., ('ключ_N', 'значение_N'))

# Для решения используй встроенные ФВП


...

# Практика 3

# Реализуй функцию get_two_digits_numbers(). Функция принимает на вход список из целых чисел.
# Твоя функция должна вернуть только двузначные числа.

...

# Практика 4

# Реализуй функцию get_metropolis, которая принимает в себя список с кортежами. Каждый кортеж содержит 2 элемента:
# название города и его население. Твоя задача вернуть список городов-милллионников(население > 1000000)
# Для решения используй ФВП и lambda функции(их очень часто применяют вместе)

...

# Практика 5
# Реализуй свою собственную функцию map

...

# Практика 6
# Реализуй свою собственную функцию filter


...