# 1

# Реализуй функцию trim_and_repeat(), которая принимает три параметра:
# строку, offset — число символов, на которое нужно обрезать строку слева и
# repetitions — количество раз, сколько ее нужно повторить, и возвращает
# получившуюся строку. Число символов для среза по умолчанию равно 0, а
# количество повторений по умолчанию 1.
# Результат работы функции сохрани в переменной result

# Примеры:

# text = 'python'

# trim_and_repeat(text, offset=3, repetitions=2)  # honhon
# trim_and_repeat(text, repetitions=3)  # pythonpythonpython
# trim_and_repeat(text)  # python

...


# #2

# Напишите функцию get_age_difference(), которая принимает два года рождения и
# возвращает строку с разницей в возрасте в виде The age difference is 11.

# Пример:
# actual = get_age_difference(2001, 2018)
# print(actual) => The age difference is 17

...


# #3

# Напиши функцию def is_castle() которая принимает строку, и определяет,
# является ли она словом "Castle"
# Результат сохрани в переменной is_castle

...

# #4
# Реализуй функцию is_even(), которая принимает на вход число, и если число
# четное, то возвращается истина. Результат работы функции сохрани в переменной
# is_even_number

# is_even(2) # => True
# is_even(10) # => True
# is_even(21) # => False

...

# #5
# Реализуй функцию has_upper_case(), которая определяет, содержит ли
# строка заглавные буквы. Функция должна вернуть булево значение:

# has_upper_case('')  # => False
# has_upper_case('python')  # => False
# has_upper_case('pyThon')  # => True

...
