# Создай простой логирующий декоратор, который оборачивает любую функцию и информирует нас о следующем:
# 1. "Функция <имя функции> была запущена"
# 2. "Функция отработала за <количество секунд>"
# 2. "Функция завершилась без ошибок"

# Для измерения времени используй функцию perf_counter из встроенного модуля time

...

# Реализуй функцию get_pairs_sum(), которая принимает на вход 2 строки из чисел через пробел. Используя list
# comprehension, сформируй и верни третий список, состоящий из суммы соответствующих пар чисел.

# get_pairs_sum('1 2 3 4 5', '6 7 8 9 10') => [7, 9, 11, 13, 15]

return data